package org.junit.demo;

public class Main {
    public static void main(String[] args) {
        System.out.println("test");

        /*I. Задача 1. Всеки студент избира един от изброените задания и разработва приложение.
         Необходимо е да отговаря на следните услови:
1. Да се създадат необходимите класове и интерфейси.
2. Да се разработят Unit(Junit) тестове, които да покриват минимум на 75% от кода на  класовете с бизнес логика.
3. Всички класове, публични методи и променливи трябва да бъдат
документирани(JavaDoc).
4. Тестовите случаи трябва да покриват всички важни ситуации(тестове с валидни,  невалидни и критични данни)
Целта на заданието не е да се разработва действителен проект а да се отрази  разбирането на работния процес.


3. Да се разработи система за управление на проекти.
 Всеки проект може да съдържа  други проекти.
  Участници - ръководител и нормални разработчици.
   Към проекта могат  да се създават различни задачи, като всяка задача може да съдържа подзадачи.
    По  задачите не може да се започне работа докато не се определи кой служител ще работи  по нея.
    Задачите трябва да има някой от статусите: нова, в процес на разработка,  завършена, отказана.
    При смяна на статус е необходимо да се въведе кратко  информационно съобщение.
    На задача, която е завършена не може да се сменя  статуса.

*/
    }
}
